In [129]:
import numpy as np
import pandas as pd

# Pandas

Pandas primarily provides two data structures:
<br/>
Series: A one-dimensional labeled array capable of holding any data type.<br/>
DataFrame: A two-dimensional labeled data structure with columns of potentially different types.

In [130]:
s = pd.Series([1, 3, 5, 7, 9])
print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [131]:
type(s)

pandas.core.series.Series

In [132]:
series_dict=pd.Series({'a':1,'b':2,'c':3})
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [133]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

Dataframe

In [134]:
data={
    'Name':['Raghu','Akash','Hemanth'],
    'Age':[18,20,19],
    'City':['Vijayawada','Banglore','Hyderabad']
}
df=pd.DataFrame(data)

df

      Name  Age        City
0    Raghu   18  Vijayawada
1    Akash   20    Banglore
2  Hemanth   19   Hyderabad

In [135]:
type(df)

pandas.core.frame.DataFrame

In [136]:
data=[
    {'Name':'A','Age':20,'City':'Bangalore'},
    {'Name':'B','Age':17,'City':'Bangalore'},
    {'Name':'C','Age':21,'City':'Bangalore'},
    {'Name':'D','Age':35,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)

df

  Name  Age       City
0    A   20  Bangalore
1    B   17  Bangalore
2    C   21  Bangalore
3    D   35  Bangalore

In [137]:
df=pd.read_csv('tips.csv')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [138]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [139]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [140]:
df['tip']

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [141]:
df.loc[0]

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [142]:
df.iloc[1]

total_bill     10.34
tip             1.66
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 1, dtype: object

In [143]:
bf=df.head(5)

In [144]:
bf

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [145]:
bf.at[2,'tip']

3.5

In [146]:
bf.iat[2,5]

'Dinner'

In [147]:
bf['Alpha']=['A','B','C','D','E']

C:\Users\Dell\AppData\Local\Temp\ipykernel_15748\1912877701.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bf['Alpha']=['A','B','C','D','E']

In [148]:
bf

   total_bill   tip     sex smoker  day    time  size Alpha
0       16.99  1.01  Female     No  Sun  Dinner     2     A
1       10.34  1.66    Male     No  Sun  Dinner     3     B
2       21.01  3.50    Male     No  Sun  Dinner     3     C
3       23.68  3.31    Male     No  Sun  Dinner     2     D
4       24.59  3.61  Female     No  Sun  Dinner     4     E

In [149]:
bf.drop('Alpha',axis=1,inplace=True)

C:\Users\Dell\AppData\Local\Temp\ipykernel_15748\2853982111.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bf.drop('Alpha',axis=1,inplace=True)

In [150]:
bf

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [151]:
bf['smoker']=bf['smoker']+' never'

C:\Users\Dell\AppData\Local\Temp\ipykernel_15748\2257304070.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bf['smoker']=bf['smoker']+' never'

In [152]:
bf

   total_bill   tip     sex    smoker  day    time  size
0       16.99  1.01  Female  No never  Sun  Dinner     2
1       10.34  1.66    Male  No never  Sun  Dinner     3
2       21.01  3.50    Male  No never  Sun  Dinner     3
3       23.68  3.31    Male  No never  Sun  Dinner     2
4       24.59  3.61  Female  No never  Sun  Dinner     4

In [153]:
bf.drop(1,inplace=True)

C:\Users\Dell\AppData\Local\Temp\ipykernel_15748\1632961506.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bf.drop(1,inplace=True)

In [154]:
bf

   total_bill   tip     sex    smoker  day    time  size
0       16.99  1.01  Female  No never  Sun  Dinner     2
2       21.01  3.50    Male  No never  Sun  Dinner     3
3       23.68  3.31    Male  No never  Sun  Dinner     2
4       24.59  3.61  Female  No never  Sun  Dinner     4

In [155]:
bf.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [156]:
bf.describe()

       total_bill       tip      size
count    4.000000  4.000000  4.000000
mean    21.567500  2.857500  2.750000
std      3.408933  1.237885  0.957427
min     16.990000  1.010000  2.000000
25%     20.005000  2.735000  2.000000
50%     22.345000  3.405000  2.500000
75%     23.907500  3.527500  3.250000
max     24.590000  3.610000  4.000000